Tekla.Structures.Model.WeldExtensions
The Tekla.Structures.Model.WeldExtensions class provides a set of static methods for querying objects of type Tekla.Structures.Model.BaseWeld.

Tekla.Structures.Model.WeldExtensions.ClosestEdgeTo(Tekla.Structures.Model.PolygonWeld,Tekla.Common.Geometry.Vector3)
Gets the closest edge of the polygonWeld to the given Tekla.Common.Geometry.Vector3 value.
polygonWeld: The Tekla.Structures.Model.PolygonWeld to get the closest edge from.
point: The Tekla.Common.Geometry.Vector3 to get the closest edge to.
Returns: The Tekla.Common.Geometry.Segment3 of the given Tekla.Structures.Model.PolygonWeld that is closest to the given Tekla.Common.Geometry.Vector3.